interfaces/cfd_interfaces/openfoam/examples/rectangular_wing/base_folder/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../simulation_settings.txt";

numberOfSubdomains $number_of_threads;

method          scotch;

coeffs
{
}
